app/controllers/characters_controller.rb

INSERT INTO "characters" ("address", "created_at", "gmaps", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @character = Character.new(params[:character])

    respond_to do |format|
      if @character.save